In [3]:
people = {
    "first": ['Lukasz','John','Jane'],
    "last": ['Kamrowski','Doe','Doe'],
    "email": ['Lukasz310@gmail.com','John.Doe@email.com','Jane.Doe@email.com']
}

In [4]:
people['email']

['Lukasz310@gmail.com', 'John.Doe@email.com', 'Jane.Doe@email.com']

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe   Jane.Doe@email.com

In [8]:
df.iloc[0]

first                 Lukasz
last               Kamrowski
email    Lukasz310@gmail.com
Name: 0, dtype: object

In [9]:
df.loc[0]

first                 Lukasz
last               Kamrowski
email    Lukasz310@gmail.com
Name: 0, dtype: object

In [10]:
df.iloc[[0,2]]

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
2    Jane        Doe   Jane.Doe@email.com

In [11]:
df.loc[[0,2]]

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
2    Jane        Doe   Jane.Doe@email.com

In [12]:
df.iloc[[0,2], [2]]

                 email
0  Lukasz310@gmail.com
2   Jane.Doe@email.com

In [13]:
df.loc[[0,2], 'email']

0    Lukasz310@gmail.com
2     Jane.Doe@email.com
Name: email, dtype: object

In [63]:
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [23]:
filt = (df['last'] == 'Kamrowski') | (df['first'] == 'John')

In [25]:
df.loc[~filt, 'email']

2    Jane.Doe@email.com
Name: email, dtype: object

In [27]:
df.columns = ['first_name', 'last_name', 'email']
df

  first_name  last_name                email
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [30]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME  LAST_NAME                EMAIL
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [32]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME  LAST_NAME                EMAIL
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [33]:
df.columns = [x.lower() for x in df.columns]
df

  first_name  last_name                email
0     Lukasz  Kamrowski  Lukasz310@gmail.com
1       John        Doe   John.Doe@email.com
2       Jane        Doe   Jane.Doe@email.com

In [50]:
df.loc[2] = ['Jane', 'Smith', 'JaneSmith@email.com']
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane      Smith  JaneSmith@email.com

In [56]:
df.columns = ['first', 'last', 'email']
df.loc[2, ['last', 'email']] = ['Doe', 'JaneDoe@email.com']
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe    JaneDoe@email.com

In [57]:
df.loc[2, ['last']] = 'Smith'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane      Smith    JaneDoe@email.com

In [64]:
df.at[2, 'last'] = 'Doe'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    John        Doe   John.Doe@email.com
2    Jane        Doe    JaneDoe@email.com

In [61]:
filt = (df['email'] == 'JaneDoe@email.com')
df[filt]

  first last              email
2  Jane  Doe  JaneDoe@email.com

In [76]:
df.columns = ['first', 'last', 'email']
df.loc[1, ["first",'last', 'email']] = ['Jane','Doe', 'JaneDoe@email.com']
df.loc[2, ["first",'last', 'email']] = ['John','Doe', 'JohnDoe@email.com']
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John        Doe    JohnDoe@email.com

In [78]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'
df

    first       last                email
0  Lukasz  Kamrowski  Lukasz310@gmail.com
1    Jane        Doe    JaneDoe@email.com
2    John      Smith    JohnDoe@email.com

In [80]:
df['email'] = df['email'].str.lower()
df

    first       last                email
0  Lukasz  Kamrowski  lukasz310@gmail.com
1    Jane        Doe    janedoe@email.com
2    John      Smith    johndoe@email.com

In [83]:
 df['email'].apply(len)

0    19
1    17
2    17
Name: email, dtype: int64

In [84]:
def update_email(email):
    return email.upper()

In [87]:
df['email'].apply(update_email)

0    LUKASZ310@GMAIL.COM
1      JANEDOE@EMAIL.COM
2      JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [89]:
df['email'] = df['email'].apply(update_email)
df

    first       last                email
0  Lukasz  Kamrowski  LUKASZ310@GMAIL.COM
1    Jane        Doe    JANEDOE@EMAIL.COM
2    John      Smith    JOHNDOE@EMAIL.COM

In [90]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

    first       last                email
0  Lukasz  Kamrowski  lukasz310@gmail.com
1    Jane        Doe    janedoe@email.com
2    John      Smith    johndoe@email.com

In [92]:
df['first'].map({'Lukasz': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [94]:
df['first'].replace({'Lukasz': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object